{"events":[{"event":{"title":"Indy Spirits Expo","time":"4:00pm","day":"Tuesday","month":"May","dayofmonth":"19","cost":"$50","free":"This event is not free","image":"http:\/\/nycwhisky.com\/sites\/nycwhisky.com\/files\/events\/logo_0.jpg","location":"Penn Club of New York","rsvp":"https:\/\/www.eventbrite.com\/e\/the-2015-ny-indie-spirits-expo-tickets-16728080138","details":"The 2015 NY Indie Spirits Expo\nMulti-Session\nVIP 4PM-9PM $100\nSession 1 5PM-7PM $50\nSession 2 7PM-9PM $50\nThe largest gathering of small, independent, family owned, handcrafted spirits and the distillers, importers, bottlers, distributors and representative under one roof! Sample some of the best of the boutique vodkas, gins, rums, tequilas, mezcals, whiskies and liqueurs from all around the world.\nMeet distilelrs, brand owners and other passionate people behind these small brands and taste their spirits.","city":"New York","street":"30 West 44th Street","fulldate":"20150519T160000Z\/20150519T160000Z 00Zm00Z"}},{"event":{"title":"Ransom Spirits @ Rôtisserie Georgette","time":"5:30pm","day":"Wednesday","month":"May","dayofmonth":"20","cost":"$50","free":"This event is not free","location":"Rotisserie Georgette","rsvp":"To reserve a seat at the bar or a bar room table call (212) 390-8060","details":"Whiskies inspired by Scottish tradition but made in small batch craft distilleries across America are the focus of our next Wednesday night tasting series during the month of May at The Bar at ROTISSERIE GEORGETTE. Jeremy Buck, our Head Bartender, will pour at least three spirits each night, not to mention some unannounced surprise pours and a house cocktail. On May 6th we feature Copper Fox Distillery of Sperryville, VA launched in 2000 following the owner’s in depth research throughout the Scottish Isles and now making the world’s first apple wood aged whisky. On May 13th, the spotlight is on Balcones Distilling, the creators of their own personal style of Texas whisky, born in a Waco welding shop and now proud of over 40 national and international awards. May 20th brings us Sheridan, Oregon’s Ransom Spirits, whose owner initially made small amounts of grappa, eau de vie, brandy and fine wines before turning to the craft of grain-based spirits. We finish the series on May 27 with Park City, Utah’s High West Distillery, based on one man’s passion to make a great Rocky Mountain Whiskey in a distillery first founded in the 1870’s.  As all booze and nothing to bite into is no fun, the whiskies will be accompanied by a duo of sliders, our best bar snacks made with Chef Chad Brauze's signature rôtisserie cooking: roast chicken and jus with grape-rosemary chutney OR lamb merguez with espelette aioli. The tastings take part on Wednesday nights in May (6th, 13th, 20th, 27th). Simply drop in any time from 5:30 to 8:30pm. The price is $50 per person. Reservations are recommended. To reserve a seat at the bar or a bar room table call (212) 390-8060\nWednesday May 6: COPPER FOX DISTILLERY presented by Distiller Rick Wasmund\nPOURING:  Copper Fox Rye Whisky, Belle Grove 1797 Whiskey, Wasmunds Single Malt Whisky\nWednesday May 13: BALCONES DISTILLING\nPOURING: Baby Blue Blue Corn Whisky, Texas Single Malt Whisky, Brimstone Texas Scrub Oak Smoked Blue Corn Whisky\nWednesday May 20: RANSOM SPIRITS\nPOURING: The Emerald 1865 Straight American Whiskey, Henry DuYore's Straight Bourbon Whiskey, WhipperSnapper Oregon Spirit Whiskey\nWednesday May 27:  HIGH WEST DISTILLERY\nPOURING: Double Rye, American Prairie Reserve Bourbon, Campfire Whiskey\nDATES: Wednesdays in May: May 6, May 13, May 20, May 27 2015\nTIME: Drop in any time 5:30 to 8:30pm\nRESERVATIONS: Recommended. To reserve a seat at the bar or a bar room table call (212) 390-8060\nPRICE: $50\/person, includes three to four pours &amp; a duo of rôtisserie sliders.\nLOCATION: The Bar at Rôtisserie Georgette, 14 East 60th Street (Madison\/5th) NYC\nFOR MORE INFORMATION: Please contact Georgette Farkas (212) 390-8060  gfarkas@rotisserieg.com","phone":"(212) 390-8060","socialnetworks":"https:\/\/www.facebook.com\/RotisserieG","website":"http:\/\/www.rotisserieg.com\/","city":"New York","street":"14 East 60th Street","fulldate":"20150520T173000Z\/20150520T173000Z 00Zm00Z"}},{"event":{"title":"Adelphi Independent Bottlings @ Brandy Library","time":"6:00pm","day":"Wednesday","month":"May","dayofmonth":"20","free":"This event is free","location":"Brandy Library","details":"Alex Bruce, from Adelphi, will be discussing the finer points of Single Cask, Cask Strength Scotch Whisky.  Adelphi selects only the finest and rare casks from across Scotland.\n6:00PM-8:00PM","phone":"(212) 226 5545","socialnetworks":"https:\/\/twitter.com\/BrandyLibrary","website":"http:\/\/brandylibrary.com","city":"New York","street":"25 North Moore St","fulldate":"20150520T180000Z\/20150520T180000Z 00Zm00Z"}},{"event":{"title":"Rye Revival @ Astor Center","time":"6:30pm","day":"Wednesday","month":"May","dayofmonth":"20","cost":"$79","free":"This event is not free","location":"Astor Center, NYC","rsvp":"http:\/\/www.astorcenternyc.com\/class-rye-revival.ac","details":"Rye Revival with Allan Roth\nFrom innovative craft distilleries across the country to the great distilleries of Kentucky, rye whiskey-bourbon’s spicier cousin and America’s first whiskey-has never seen better days. Initially fueled by the explosion of craft cocktails in the late 90s, the current “Rye Revival” has taken on a life of its own.\nThis class will focus on tracing the evolution of rye whiskey from the early Monongahela- and Maryland-style ryes through the move of most major rye distillation to Kentucky, and through the increase in corn content through the explosion of two very distinctive ryes out of Indiana and Canada. Major talking points will focus on the impact of history and economics on the flavor profiles of rye.\nLearning Objectives:\n-Learn whiskey tasting and evaluation methods.\n-Explore, through tasting, the flavor profiles of selected spirits.\n-Characterize the major flavor profiles most present in rye whiskeys.\n-Identify the four main sources of contemporary rye (LDI, Alberta, Kentucky, Craft).\n-Explain the concept of distillery characteristic in flavor profile.\n-Understand why rye was the first grain of choice for American whiskey distilling.\nGuests Will Receive:\n-One welcome beverage.\n-Six tasting pours of rye whiskey.\n-Palate-cleansing bread and cheese.\n-Two hours of education, with time for Q&amp;A.\n-Access to The Study, Astor Center’s state-of-the-art tasting facility.","website":"http:\/\/www.astorcenternyc.com","city":"New York","street":"399 Lafayette St.","fulldate":"20150520T183000Z\/20150520T183000Z 00Zm00Z"}},{"event":{"title":"All About Bourbon Whiskey class @ The Flatiron Room","time":"7:00pm","day":"Wednesday","month":"May","dayofmonth":"20","cost":"$85","free":"This event is not free","location":"The Flatiron Room","rsvp":"http:\/\/www.brownpapertickets.com\/event\/1475513","details":"We delve into the rich history of Bourbon and explore how its very humble beginning has transformed into a massive powerhouse in the liquor world. We'll learn about and taste product from the legendary distilleries behind the most recognizable brands in America. Signature cocktail and light appetizers provided.\nPAYMENT, REFUND, AND TICKET TRANSFERRAL POLICIES\nTo register for any class at The Flatiron Room, payment in full is required at the time of registration. Credit may be issued for a future class by notifying us in writing at least 7 days prior to class date by emailing Evelina at Evelina@TheFlatironRoom.com. Or you are free to transfer your space in the class to a friend, family member or colleague. Simply email Evelina@TheFlatironRoom.com with the name of your substitute.","phone":"212-725-3860","socialnetworks":"http:\/\/www.facebook.com\/TheFlatironRoom?fref=ts","website":"http:\/\/www.theflatironroom.com\/","city":"New York","street":"37 West 26th Street","fulldate":"20150520T190000Z\/20150520T190000Z 00Zm00Z"}},{"event":{"title":"Usquaebach Blended Whisky @ Oak &amp; Steel","time":"5:00pm","day":"Thursday","month":"May","dayofmonth":"21","free":"This event is free","location":"Oak &amp; Steel","details":"5-8pm\nUsquaebach Blended Whisky from the Highlands, Scotland\n Aged 15 years in oak and sherry casks...","phone":"212-262-7702","socialnetworks":"https:\/\/twitter.com\/OakandSteelNYC","website":"http:\/\/oakandsteel.com\/","city":"New York","street":"1776 Broadway","fulldate":"20150521T170000Z\/20150521T170000Z 00Zm00Z"}},{"event":{"title":"Collier and McKeel Tennessee Whiskey @ Northern Bell","time":"6:00pm","day":"Thursday","month":"May","dayofmonth":"21","free":"This event is free","location":"Northern Bell","details":"Collier and McKeel Tennessee Whiskey Tasting at the Northern Bell. Starts at 6PM.","socialnetworks":"https:\/\/twitter.com\/northernbellny","website":"http:\/\/www.northernbellny.com\/","city":"Brooklyn","street":"612 Metropolitan Avenue","fulldate":"20150521T180000Z\/20150521T180000Z 00Zm00Z"}},{"event":{"title":"Taste Barrell Bourbon and Whiskey @ Duke&#039;s Liquor Box","time":"6:00pm","day":"Thursday","month":"May","dayofmonth":"21","free":"This event is free","location":"Duke&#039;s Liquor Box","details":"6 to 8 PM\nCome taste Barrell Whiskey Batch 001 and Barrell Bourbon Batch 004 and meet the owners at Duke's Liquor Box between 6 PM and 8 PM on Thursday, May 21st.\nBarrell Bourbon won a Double Gold Medal in the 2015 San Francisco World Spirits Competition and was a Finalist in the 2014 and 2015 Ultimate Spirits Challenge, scoring 95\/100. It has been reviewed as \"one smooth sipper\" with a \"long and warming\" finish and a \"complex bouquet of crushed toasted walnuts, honey vanilla and tangerine [that] leaps from the glass.\" Geoff Kleinman, founder and managing editor at DrinkSpirits.com, says \"the folks at Barrell Bourbon have a real knack for picking good whiskeys with great flavor and character.\"\nBarrell Whiskey won a Double Gold Medal in the 2015 San Francisco World Spirits Competition and was a Finalist in the 2015 Ultimate Spirits Challenge, scoring 93\/100. \"Crusty, egg battered brioche – French toast dripping in butter and dark maple syrup. Brooding alcohol explodes right up front, no mistaking the 122.5 Proof stuffing of each slurp. Thin rivulets of bruleed corn pudding. Rich swirls of darkly scented, spicy Mexican chocolate become soft eruptions at the finish, leaving you with visions of the next sip.\"\nBarrell Bourbon and Barrell Whiskey are bottled at cask strength and each batch has a distinct flavor profile. Read more about Barrell Whiskey and Barrell Bourbon at www.barrellbourbon.com Available now in limited quantities at select retailers.\nBarrell Bourbon\nFollow us on Facebook\nFollow us on Twitter\nFollow us on Instagram\nFollow us on LinkedIn","phone":"(347) 534-3088","socialnetworks":"http:\/\/facebook.com\/dukesliquorbox","website":"http:\/\/dukesliquorbox.com","city":"Brooklyn","street":"170 Franklin St","fulldate":"20150521T180000Z\/20150521T180000Z 00Zm00Z"}},{"event":{"title":"18 and Gorgeous @ Brandy Library","time":"3:00pm","day":"Saturday","month":"May","dayofmonth":"23","cost":"$120","free":"This event is not free","location":"Brandy Library","rsvp":"https:\/\/gosnazz.com\/event\/2243\/may-23-2015\/18-and-gorgeous\/?r=23115","details":"18 and Gorgeous\nThe whisky is firm, fresh and yet it shows a confidence only brought by maturity. 18 seems to be the sweet spot for fine Scotch: vibrant, with a lot of personality and character. Wait...when it comes to Scotch, most of the whisky produced is either used in blends or consumed right passed its 12th birthday. Let us explore a variety of styles, all at 18 years certainly, and see if this age statement holds up to its fame. In the Industry, some swear by 15, others say 21 is really the peak...we need to know what happens in between. Why is it such a benchmark, and is it even still a valid one in this era of \"NAS\" (no age statement)? How relevant is age after all? Well, just like you can't drive until a certain age, some whiskies can be too green until a certain point. What is the impact of longer maturation, what is the chemistry at work in these cold and damp warehouses of Scotland? What if the barrel had a negative influence on the whisky? This class best serves the regular Scotch Whisky drinker...and all savvy palates alike!","phone":"(212) 226 5545","socialnetworks":"https:\/\/twitter.com\/BrandyLibrary","website":"http:\/\/brandylibrary.com","city":"New York","street":"25 North Moore St","fulldate":"20150523T150000Z\/20150523T150000Z 00Zm00Z"}},{"event":{"title":"Spring Smash and Sour Cocktails @ Char No. 4","time":"4:00pm","day":"Saturday","month":"May","dayofmonth":"23","cost":"$45","free":"This event is not free","location":"Char No. 4","rsvp":"Call (718) 643-2106 or stop by the restaurant to purchase a whiskey class.","details":"Spring Smash and Sour Cocktails\nSaturday, May 23rd, 4pm\nCocktails: The Kenny Perry, The Sazerac Rye Smash, The Classic Whiskey Sour\nWhiskey is great for any season, any occassion. And during the hot summer months whiskey recommends itself particularly well over ice and in well chilled cocktails. Join us for this Saturday afternoon class when we'll unlock the cocktail's ability to transform American whiskeys from a warm, rich spirit into a crisp, refreshing summer beverage. Our expert bartenders will teach you how to prepare ingredients and make delicious, chilly summer libations.  \nAdmission: $45 per person including tax and gratuity.  \n5\/30 - Diamonds in the Rough","phone":"(718) 643-2106","socialnetworks":"http:\/\/twitter.com\/charno4","website":"http:\/\/charno4.com\/","city":"Brooklyn","street":"196 Smith Street","fulldate":"20150523T160000Z\/20150523T160000Z 00Zm00Z"}},{"event":{"title":"Taste Barrell Bourbon and Whiskey @ Acker Merrall &amp; Condit","time":"5:30pm","day":"Saturday","month":"May","dayofmonth":"23","free":"This event is free","location":"Acker Merrall &amp; Condit","details":"5:30 to 7:30 PM\nCome taste Barrell Whiskey Batch 001 and Barrell Bourbon Batch 004 and meet the owners at Acker Merrall and Condit between 5:30 PM and 7:30 PM on Saturday, May 23rd.\nBarrell Bourbon won a Double Gold Medal in the 2015 San Francisco World Spirits Competition and was a Finalist in the 2014 and 2015 Ultimate Spirits Challenge, scoring 95\/100. It has been reviewed as \"one smooth sipper\" with a \"long and warming\" finish and a \"complex bouquet of crushed toasted walnuts, honey vanilla and tangerine [that] leaps from the glass.\" Geoff Kleinman, founder and managing editor at DrinkSpirits.com, says \"the folks at Barrell Bourbon have a real knack for picking good whiskeys with great flavor and character.\"\nBarrell Whiskey won a Double Gold Medal in the 2015 San Francisco World Spirits Competition and was a Finalist in the 2015 Ultimate Spirits Challenge, scoring 93\/100. \"Crusty, egg battered brioche – French toast dripping in butter and dark maple syrup. Brooding alcohol explodes right up front, no mistaking the 122.5 Proof stuffing of each slurp. Thin rivulets of bruleed corn pudding. Rich swirls of darkly scented, spicy Mexican chocolate become soft eruptions at the finish, leaving you with visions of the next sip.\"\nBarrell Bourbon and Barrell Whiskey are bottled at cask strength and each batch has a distinct flavor profile. Read more about Barrell Whiskey and Barrell Bourbon at www.barrellbourbon.com Available now in limited quantities at select retailers.\nBarrell Bourbon\nFollow us on Facebook\nFollow us on Twitter\nFollow us on Instagram\nFollow us on LinkedIn","phone":"212 787 1700","socialnetworks":"http:\/\/twitter.com\/AckerMerrall","website":"http:\/\/home.ackerstore.com\/?p=1295","city":"New York","street":"160 West 72nd Street","fulldate":"20150523T173000Z\/20150523T173000Z 00Zm00Z"}},{"event":{"title":"The Best of Whisk(e)y @ Brandy Library","time":"3:00pm","day":"Monday","month":"May","dayofmonth":"25","cost":"$250","free":"This event is not free","location":"Brandy Library","rsvp":"https:\/\/gosnazz.com\/event\/2240\/apr-25-2015\/best-of-whiskey\/","details":"There are many countries now producing whisk(e)y: South Africa, Australia, France and Iceland - each presenting beautiful examples of the kind. For this class, we'll stick to the 5 \"traditional\" benchmarks: Scotland, Ireland, Japan, Canada and the U.S.A. We each have our take on who should receive the top honors, but when it comes to explaining the reasons of our preferences, it's very often down to preconceived opinions...this is why this class will be conducted \"half-blind\"! You know what will be poured, but not the order in which the whiskies will be poured. What makes a whisk(e)y great anyway? To best answer, we must study the main aspects of its genesis: water, grain, yeast, copper, oak...and the men at work! One could argue that age, or scarcity, make a drink \"the one.” The longer the whisk(e)y matures, the better it \"can\" become...or not! Up until recently, barely any American distiller would venture leaving it in the barrel for more than 12 years. And while the Scots thought this was right then that it became palatable, very few would keep it over 18 years in the cask. The Canadians would use most of their older spirits as blending components...You will be the judge in this battle of the Whisk(e)y kings! A very rare tasting.","phone":"(212) 226 5545","socialnetworks":"https:\/\/twitter.com\/BrandyLibrary","website":"http:\/\/brandylibrary.com","city":"New York","street":"25 North Moore St","fulldate":"20150525T150000Z\/20150525T150000Z 00Zm00Z"}},{"event":{"title":"Madison Malt Drinkers Scotch Dinner @ St Andrews","time":"7:00pm","day":"Tuesday","month":"May","dayofmonth":"26","cost":"$125","free":"This event is not free","location":"St. Andrews Restaurant and Bar","rsvp":"Please call Marlon at 646-491-0822 or email whiskyconn@gmail.com","details":"Come taste whisky from the Arran, Tamdhu and Kilchoman Distilleries as well as a couple single casks from the Exclusive Malts Bottlings (1998 Girvan Single Grain 26yr and a 1994 Glen Garioch 20yr). \nPresented by Joshua Hatton, ImpEx Beverages Regional Sales Executive. In addition to his role with ImpEx, Joshua in the CEO and President of Jewish Whisky Company, Single Cask Nation, and the now famous, Whisky Jewbilee festival. Single Cask Nation is a private membership group owned by Jewish Whisky Company; “The Nation” boasts more than 600 members nationwide.\nJoshua has toured and learned from more than 25 distilleries between both Scotland and the United States and has conducted hundreds of whisky tasting events. \nCost: $125.00 (Dinner,Tax &amp; Tip Included)\nRSVP: Please call Marlon at 646-491-0822 or whiskyconn@gmail.com by Monday May 18th \nSeats are Limited\nForward cover charge in full CASH or CHECK made payable to MMD by Friday May 22nd \nPayment accepted via mail\nMMD c\/o Marlon Paltoo\n333 Vincellette Street Suite 26\nBridgeport CT 06606 \nPayment also accepted in person at Park Avenue Liquor Shop 270 Madison Avenue, New York NY 10016","phone":"(212) 840-8413","socialnetworks":"http:\/\/twitter.com\/standrewsny","website":"http:\/\/www.standrewsnyc.com","city":"New York","street":"140 West 46th Street","fulldate":"20150526T190000Z\/20150526T190000Z 00Zm00Z"}},{"event":{"title":"High West Distillery @ Rôtisserie Georgette","time":"5:30pm","day":"Wednesday","month":"May","dayofmonth":"27","cost":"$50","free":"This event is not free","location":"Rotisserie Georgette","rsvp":"To reserve a seat at the bar or a bar room table call (212) 390-8060","details":"Whiskies inspired by Scottish tradition but made in small batch craft distilleries across America are the focus of our next Wednesday night tasting series during the month of May at The Bar at ROTISSERIE GEORGETTE. Jeremy Buck, our Head Bartender, will pour at least three spirits each night, not to mention some unannounced surprise pours and a house cocktail. On May 6th we feature Copper Fox Distillery of Sperryville, VA launched in 2000 following the owner’s in depth research throughout the Scottish Isles and now making the world’s first apple wood aged whisky. On May 13th, the spotlight is on Balcones Distilling, the creators of their own personal style of Texas whisky, born in a Waco welding shop and now proud of over 40 national and international awards. May 20th brings us Sheridan, Oregon’s Ransom Spirits, whose owner initially made small amounts of grappa, eau de vie, brandy and fine wines before turning to the craft of grain-based spirits. We finish the series on May 27 with Park City, Utah’s High West Distillery, based on one man’s passion to make a great Rocky Mountain Whiskey in a distillery first founded in the 1870’s.  As all booze and nothing to bite into is no fun, the whiskies will be accompanied by a duo of sliders, our best bar snacks made with Chef Chad Brauze's signature rôtisserie cooking: roast chicken and jus with grape-rosemary chutney OR lamb merguez with espelette aioli. The tastings take part on Wednesday nights in May (6th, 13th, 20th, 27th). Simply drop in any time from 5:30 to 8:30pm. The price is $50 per person. Reservations are recommended. To reserve a seat at the bar or a bar room table call (212) 390-8060\nWednesday May 6: COPPER FOX DISTILLERY presented by Distiller Rick Wasmund\nPOURING:  Copper Fox Rye Whisky, Belle Grove 1797 Whiskey, Wasmunds Single Malt Whisky\nWednesday May 13: BALCONES DISTILLING\nPOURING: Baby Blue Blue Corn Whisky, Texas Single Malt Whisky, Brimstone Texas Scrub Oak Smoked Blue Corn Whisky\nWednesday May 20: RANSOM SPIRITS\nPOURING: The Emerald 1865 Straight American Whiskey, Henry DuYore's Straight Bourbon Whiskey, WhipperSnapper Oregon Spirit Whiskey\nWednesday May 27:  HIGH WEST DISTILLERY\nPOURING: Double Rye, American Prairie Reserve Bourbon, Campfire Whiskey\nDATES: Wednesdays in May: May 6, May 13, May 20, May 27 2015\nTIME: Drop in any time 5:30 to 8:30pm\nRESERVATIONS: Recommended. To reserve a seat at the bar or a bar room table call (212) 390-8060\nPRICE: $50\/person, includes three to four pours &amp; a duo of rôtisserie sliders.\nLOCATION: The Bar at Rôtisserie Georgette, 14 East 60th Street (Madison\/5th) NYC\nFOR MORE INFORMATION: Please contact Georgette Farkas (212) 390-8060  gfarkas@rotisserieg.com","phone":"(212) 390-8060","socialnetworks":"https:\/\/www.facebook.com\/RotisserieG","website":"http:\/\/www.rotisserieg.com\/","city":"New York","street":"14 East 60th Street","fulldate":"20150527T173000Z\/20150527T173000Z 00Zm00Z"}},{"event":{"title":"Taste Barrell Bourbon and Whiskey @ Pour Wines","time":"5:00pm","day":"Friday","month":"May","dayofmonth":"29","free":"This event is free","location":"Pour Wines","details":"5 to 8 PM\nCome taste Barrell Whiskey Batch 001 and Barrell Bourbon Batch 004 and meet the owners at Pour wines between 5 PM and 8 PM on Friday, May 29th.\nBarrell Bourbon won a Double Gold Medal in the 2015 San Francisco World Spirits Competition and was a Finalist in the 2014 and 2015 Ultimate Spirits Challenge, scoring 95\/100. It has been reviewed as \"one smooth sipper\" with a \"long and warming\" finish and a \"complex bouquet of crushed toasted walnuts, honey vanilla and tangerine [that] leaps from the glass.\" Geoff Kleinman, founder and managing editor at DrinkSpirits.com, says \"the folks at Barrell Bourbon have a real knack for picking good whiskeys with great flavor and character.\"\nBarrell Whiskey won a Double Gold Medal in the 2015 San Francisco World Spirits Competition and was a Finalist in the 2015 Ultimate Spirits Challenge, scoring 93\/100. \"Crusty, egg battered brioche – French toast dripping in butter and dark maple syrup. Brooding alcohol explodes right up front, no mistaking the 122.5 Proof stuffing of each slurp. Thin rivulets of bruleed corn pudding. Rich swirls of darkly scented, spicy Mexican chocolate become soft eruptions at the finish, leaving you with visions of the next sip.\"\nBarrell Bourbon and Barrell Whiskey are bottled at cask strength and each batch has a distinct flavor profile. Read more about Barrell Whiskey and Barrell Bourbon at www.barrellbourbon.com Available now in limited quantities at select retailers.\nBarrell Bourbon\nFollow us on Facebook\nFollow us on Twitter\nFollow us on Instagram\nFollow us on LinkedIn","phone":"212-501-7687","socialnetworks":"https:\/\/twitter.com\/PourWines","website":"http:\/\/pourwines.myshopify.com\/","city":"New York","street":"321 Amsterdam Ave","fulldate":"20150529T170000Z\/20150529T170000Z 00Zm00Z"}},{"event":{"title":"Diamonds in the Rough @ Char No. 4","time":"4:00pm","day":"Saturday","month":"May","dayofmonth":"30","cost":"$35","free":"This event is not free","location":"Char No. 4","rsvp":"Call (718) 643-2106 or stop by the restaurant to purchase a whiskey class.","details":"Diamonds in the Rough\nSaturday, May 30th, 4pm\nWhiskeys: Bowman Brothers Small Batch, Old Charter 8 Year,\nGeorge Dickel No. 12, Old Grand-Dad 114\nSome of the best American whiskeys never see their names in the glossy pages of magazines or emblazoned in grand scale on billboards.  Please join us for an afternoon with some of the best kept secrets in American whiskey, both delicious and affordable.\nAdmission: $35 per person.","phone":"(718) 643-2106","socialnetworks":"http:\/\/twitter.com\/charno4","website":"http:\/\/charno4.com\/","city":"Brooklyn","street":"196 Smith Street","fulldate":"20150530T160000Z\/20150530T160000Z 00Zm00Z"}},{"event":{"title":"Whiskey 101 Class @ The Flatiron Room","time":"7:00pm","day":"Saturday","month":"May","dayofmonth":"30","cost":"$85","free":"This event is not free","rsvp":"http:\/\/www.brownpapertickets.com\/event\/1475519","details":"This is our most popular class to date. After taking this class, you'll be well versed in\nconcepts such as the role of peat in whisky-making, chill filtration. Scotland's\nwhisky making regions how to nose and taste, evaluation and even how to pronounce\nGaelic words. Signature cocktail and light appetizers provided.\nOur whiskey school offers courses for all levels. We have classes for connoisseurs, and others for beginners who are simply curious to learn more.\nPAYMENT, REFUND, AND TICKET TRANSFERRAL POLICIES\nTo register for any class at The Flatiron Room, payment in full is required at the time of registration. Credit may be issued for a future class by notifying us in writing at least 7 days prior to class date by emailing Evelina at Evelina@TheFlatironRoom.com.  Or you can transfer your space in the class to a friend, family member or colleague. Simply email Evelina@TheFlatironRoom.com with the name of your substitute.","fulldate":"20150530T190000Z\/20150530T190000Z 00Zm00Z"}},{"event":{"title":"Modern Scotch: old vs new @ Brandy Library","time":"3:00pm","day":"Saturday","month":"Jun","dayofmonth":"6","cost":"$120","free":"This event is not free","location":"Brandy Library","rsvp":"https:\/\/gosnazz.com\/event\/2244\/jun-06-2015\/modern-scotch-old-v-new\/","details":"Wasn't it better then? \nThe mystique of the bygone days, along with the \"ultra-premiumization\" of Scotch and the growing curiosity of our Millenial minds...all of this is pushing the question forward. You always hear: \"the blender's art is to create the same expression over and over, by marrying different styles and ages\" and given that your palate also evolves with time, you might not pick up the slight changes in these malts or blends. Was this 12 year old made 20 years ago the same as its modern version? Here, we taste side by side an old expression and the current expression of one brand and mark. At stake is whether you can trust your own judgment: you may have disliked this particular whisky 10 years ago, and you've never given it more attention since...but what if it is NOW to your liking? Four marks will be analyzed in pairs, for a total of 8 Single Malt Scotches. You can do it. Is it for Scotch like it is for cars and dishwashers, i.e. wasn't it better made then? We'll go through some important moments of the Scotch Whisky History while trying to nail down the causes for stylistic changes.","phone":"(212) 226 5545","socialnetworks":"https:\/\/twitter.com\/BrandyLibrary","website":"http:\/\/brandylibrary.com","city":"New York","street":"25 North Moore St","fulldate":"20150606T150000Z\/20150606T150000Z 00Zm00Z"}},{"event":{"title":"Macallan @ Aries Wine &amp; Spirits","time":"7:00pm","day":"Sunday","month":"Jun","dayofmonth":"7","cost":"$15","free":"This event is not free","location":"Aries Wines &amp; Spirits","rsvp":"www.aries-wineny.com","details":"The Macallan and Aries Wine and Spirits invite you to celebrate this Father’s Day with the world’s most precious whisky at the private single malt tasting and seminar. Join The Macallan’s own Brand Ambassador Nicola Riske and learn about the world of single malts, distillation and aging process, types of casks, maturity and much more! The evening will also include a tasting of several The Macallan single malts, including The Macallan Rare Cask.\nThe tasting will take place on Thursday, June 11th @ 7pm at Aries Wine &amp; Spirits. The ticket price is $15 or $25 for a couple and can be applied towards purchase of any bottle presented at the tasting! Tickets can be purchased online at: www.aries-wineny.com Please keep in mind that the space is limited.","phone":"914-946-3382","website":"http:\/\/www.aries-wineny.com\/","city":"White Plains","street":"128 West Post Road","fulldate":"20150607T190000Z\/20150607T190000Z 00Zm00Z"}},{"event":{"title":"Blind Whisk(e)y @ Brandy Library","time":"6:00pm","day":"Tuesday","month":"Jun","dayofmonth":"9","cost":"$90","free":"This event is not free","location":"Brandy Library","rsvp":"https:\/\/gosnazz.com\/event\/2245\/jun-09-2015\/blind-whiskey\/?r=23115","details":"Blind Whisk(e)y\nAre you up to the challenge? Can you recognize a Japanese whisky from a Scotch whisky? Malted barley from rye? Tell the difference between a wheated Bourbon and a traditional one? Pick up the smoke in an old single malt? Tell the difference between sherry and port wine barrel finishes? Have you really done your homework lately? Are you really sure to recognize these benchmark whiskies you have not re-tasted in years? How do you know your palate has not evolved since then? It takes a lot of courage - simply humility - to attend this class, but face it: you have doubts! Nobody will judge you, it's just fun and you might even learn a few things throughout this exercise. Ideal class for long-time friends to attend together, humble whisk(e)y drinkers and confident collectors. In this ever-changing globalized whisk(e)y environment, it's good to be able to reset your palate and re-establish solid foundations. But you're in for a few surprises...","phone":"(212) 226 5545","socialnetworks":"https:\/\/twitter.com\/BrandyLibrary","website":"http:\/\/brandylibrary.com","city":"New York","street":"25 North Moore St","fulldate":"20150609T180000Z\/20150609T180000Z 00Zm00Z"}},{"event":{"title":"Scotch 101 Class @ The Flatiron Room","time":"7:00pm","day":"Tuesday","month":"Jun","dayofmonth":"9","cost":"$85","free":"This event is not free","location":"The Flatiron Room","rsvp":"http:\/\/www.brownpapertickets.com\/event\/1621395","details":"So you thought all Scotch was smokey and peaty? Do you know what peat is or smells like? Did you know that there are over 90 distilleries in Scotland who make whiskies that do not feature smoke or peat? After taking this class, you’ll understand peat’s role in the production of Scotch, as well as completely understand concepts like cask-strength, chill filtration, and other bottle-label snippets. Signature cocktail and light appetizers provided.","phone":"212-725-3860","socialnetworks":"http:\/\/www.facebook.com\/TheFlatironRoom?fref=ts","website":"http:\/\/www.theflatironroom.com\/","city":"New York","street":"37 West 26th Street","fulldate":"20150609T190000Z\/20150609T190000Z 00Zm00Z"}},{"event":{"title":"The Macallan 1946 Select Reserve Tasting Dinner @ Chelsea Wines","time":"7:00pm","day":"Thursday","month":"Jun","dayofmonth":"11","cost":"$2500","free":"This event is not free","location":"Chelsea Wine Vault","rsvp":"http:\/\/www.chelseawinevault.com\/classes-events\/the-macallan-1946-select-reserve-tasting-dinner-thursday-june-11th-2015-7-00pm#.VUz9__lVhBc","details":"The Macallan 1946 Select Reserve Tasting Dinner\nThere’s one rule for collectible Scotch: never drink it. \nChelsea Wine Vault is about to break that rule. At an exclusive dinner, we will open and pour The Macallan 1946 Select Reserve, a rare 52-year-old Scotch worth over $20,000. There are no other bottles of this whisky for sale in the US, so it’s no exaggeration to call this a once-in-a-lifetime event. \nThis event will be hosted by Craig Bridger, Brand Ambassador for The Macallan and David Hunter, General Manager and Wine Buyer of Chelsea Wine Vault. Twelve lucky guests will taste The Macallan 1946 Select Reserve at this guided tasting and dinner. The Macallan Rare Cask will be the house spirit for the evening, paired with a three-course dinner by Robert Bleifer, Executive Chef of Food Network. \nOther rare vintage Macallans will be available for sale after the event, including bottlings like The Macallan 25th Anniversary Edition 1957 25 Year Old, The Macallan 1962 25 Year Old, Macallan 1950 30 Year Old, and Macallan Gran Reserva 1979 18 Year Old. \nMost collectors would never dream of opening their antique bottles, because their main value lies in their pristine state. But whisky is made to be opened, to be sipped and savored, and it’s only natural to want to taste a particularly rare bottle.","phone":"(212) 462 4244","socialnetworks":"http:\/\/twitter.com\/chelseawine","website":"http:\/\/www.chelseawinevault.com\/events.php","city":"New York","street":"75 Ninth Avenue","fulldate":"20150611T190000Z\/20150611T190000Z 00Zm00Z"}},{"event":{"title":"Taste Barrell Bourbon and Whiskey @ DrinkUpNY","time":"5:30pm","day":"Friday","month":"Jun","dayofmonth":"12","free":"This event is free","location":"DrinkUpNY","details":"5:30 PM to 7:30 PM\nCome taste Barrell Whiskey Batch 001 and Barrell Bourbon Batch 004 and meet the owners at DrinkUpNY between 5:30 PM and 7:30 PM on Friday, June 12th.\nBarrell Bourbon won a Double Gold Medal in the 2015 San Francisco World Spirits Competition and was a Finalist in the 2014 and 2015 Ultimate Spirits Challenge, scoring 95\/100. It has been reviewed as \"one smooth sipper\" with a \"long and warming\" finish and a \"complex bouquet of crushed toasted walnuts, honey vanilla and tangerine [that] leaps from the glass.\" Geoff Kleinman, founder and managing editor at DrinkSpirits.com, says \"the folks at Barrell Bourbon have a real knack for picking good whiskeys with great flavor and character.\"\nBarrell Whiskey won a Double Gold Medal in the 2015 San Francisco World Spirits Competition and was a Finalist in the 2015 Ultimate Spirits Challenge, scoring 93\/100. \"Crusty, egg battered brioche – French toast dripping in butter and dark maple syrup. Brooding alcohol explodes right up front, no mistaking the 122.5 Proof stuffing of each slurp. Thin rivulets of bruleed corn pudding. Rich swirls of darkly scented, spicy Mexican chocolate become soft eruptions at the finish, leaving you with visions of the next sip.\"\nBarrell Bourbon and Barrell Whiskey are bottled at cask strength and each batch has a distinct flavor profile. Read more about Barrell Whiskey and Barrell Bourbon at www.barrellbourbon.com Available now in limited quantities at select retailers.\nBarrell Bourbon\nFollow us on Facebook\nFollow us on Twitter\nFollow us on Instagram\nFollow us on LinkedIn","phone":"1-800-658-8149","socialnetworks":"http:\/\/twitter.com\/DrinkUpNY","website":"https:\/\/www.drinkupny.com\/Articles.asp?ID=133","city":"Brooklyn","street":"468 4th Ave","fulldate":"20150612T173000Z\/20150612T173000Z 00Zm00Z"}},{"event":{"title":"Whisk(e)y Monday: Barrell Bourbon and Whiskey @ Ward III","time":"8:00pm","day":"Monday","month":"Jun","dayofmonth":"15","free":"This event is free","location":"Ward III","details":"Come taste Barrell Whiskey Batch 001 and Barrell Bourbon Batch 004 and meet the owners at Ward III between 6:15 PM and 8:15 PM on Monday, June 1st.\nBarrell Bourbon won a Double Gold Medal in the 2015 San Francisco World Spirits Competition and was a Finalist in the 2014 and 2015 Ultimate Spirits Challenge, scoring 95\/100. It has been reviewed as \"one smooth sipper\" with a \"long and warming\" finish and a \"complex bouquet of crushed toasted walnuts, honey vanilla and tangerine [that] leaps from the glass.\" Geoff Kleinman, founder and managing editor at DrinkSpirits.com, says \"the folks at Barrell Bourbon have a real knack for picking good whiskeys with great flavor and character.\"\nBarrell Whiskey won a Double Gold Medal in the 2015 San Francisco World Spirits Competition and was a Finalist in the 2015 Ultimate Spirits Challenge, scoring 93\/100. \"Crusty, egg battered brioche – French toast dripping in butter and dark maple syrup. Brooding alcohol explodes right up front, no mistaking the 122.5 Proof stuffing of each slurp. Thin rivulets of bruleed corn pudding. Rich swirls of darkly scented, spicy Mexican chocolate become soft eruptions at the finish, leaving you with visions of the next sip.\"\nBarrell Bourbon and Barrell Whiskey are bottled at cask strength and each batch has a distinct flavor profile. Read more about Barrell Whiskey and Barrell Bourbon at www.barrellbourbon.com Available now in limited quantities at select retailers.\nBarrell Bourbon\nFollow us on Facebook\nFollow us on Twitter\nFollow us on Instagram\nFollow us on LinkedIn","phone":"(212) 240-9189","socialnetworks":"http:\/\/www.facebook.com\/pages\/Ward-III\/93089902749","website":"http:\/\/www.ward3tribeca.com\/","city":"New York","street":"111 Reade Street","fulldate":"20150615T200000Z\/20150615T200000Z 00Zm00Z"}},{"event":{"title":"Rare and Precious Japanese Whisky @ Brandy Library","time":"3:00pm","day":"Saturday","month":"Jun","dayofmonth":"20","cost":"$120","free":"This event is not free","location":"Brandy Library","rsvp":"https:\/\/gosnazz.com\/event\/2242\/jun-20-2015\/rare-and-precious-japanese-whisky\/?r=23115","details":"Rare and Precious Japanese Whisky\nJapan is the second largest Single Malt producing country in the world...and some argue it stands ahead of everybody else when it comes to quality! This is no news to our friends in Europe and Asia, but the idea of high-quality whiskies from the Land of the Rising Sun remains a novelty here in the US, for we only recently got to receive not only the big boys' marks, but also a few small producers' crafty bottlings. What is so special anyway about this whisky made in Japan? The last 10 years' international competitions seem to translate an overwhelming superiority to all whiskies \"made in Japan\": single malts, blended malts, blended whiskies...is it the water? The grain? The oak perhaps? Science has something to do with it, and Scotland too! Dive into a world of elegance and power, of strength and containment. Slainte, and Kampai!","phone":"(212) 226 5545","socialnetworks":"https:\/\/twitter.com\/BrandyLibrary","website":"http:\/\/brandylibrary.com","city":"New York","street":"25 North Moore St","fulldate":"20150620T150000Z\/20150620T150000Z 00Zm00Z"}},{"event":{"title":"American Whiskeys Class @ The Flatiron Room","time":"7:00pm","day":"Tuesday","month":"Jun","dayofmonth":"23","cost":"$85","free":"This event is not free","location":"The Flatiron Room","rsvp":"http:\/\/www.brownpapertickets.com\/event\/1621390","details":"This class will give you an in-depth look at the differences in the American whiskey variations. If you thought all whiskey was the same - think again. Signature cocktail and light appetizers provided.\nPAYMENT, REFUND, AND TICKET TRANSFERRAL POLICIES \nTo register for any class at The Flatiron Room, payment in full is required at the time of registration. Credit may be issued for a future class by notifying us in writing at least 7 days prior to class date by emailing Evelina at Evelina@TheFlatironRoom.com. Or you are free to transfer your space in the class to a friend, family member or colleague. Simply email Evelina@TheFlatironRoom.com with the name of your substitute.","phone":"212-725-3860","socialnetworks":"http:\/\/www.facebook.com\/TheFlatironRoom?fref=ts","website":"http:\/\/www.theflatironroom.com\/","city":"New York","street":"37 West 26th Street","fulldate":"20150623T190000Z\/20150623T190000Z 00Zm00Z"}},{"event":{"title":"Luxury Whiskeys class @ The Flatiron Room","time":"7:00pm","day":"Saturday","month":"Jun","dayofmonth":"27","cost":"$125","free":"This event is not free","location":"The Flatiron Room","rsvp":"http:\/\/www.brownpapertickets.com\/event\/1621397","details":"Join The Flatiron Room’s Tommy Tardie as he walks you through 6 of his current favorite whiskies. You’ll learn about the effects of wood in maturation, the distillation process, the malting of barley and all about “peat”. Signature cocktail and light appetizers provided.","phone":"212-725-3860","socialnetworks":"http:\/\/www.facebook.com\/TheFlatironRoom?fref=ts","website":"http:\/\/www.theflatironroom.com\/","city":"New York","street":"37 West 26th Street","fulldate":"20150627T190000Z\/20150627T190000Z 00Zm00Z"}},{"event":{"title":"Whisk(e)y Monday: Glendronach @ Ward III","time":"8:00am","day":"Monday","month":"Jun","dayofmonth":"29","free":"This event is free","location":"Ward III","details":"Whisk(e)y Monday at Ward III with Glendronach\n8PM-10PM","phone":"(212) 240-9189","socialnetworks":"http:\/\/www.facebook.com\/pages\/Ward-III\/93089902749","website":"http:\/\/www.ward3tribeca.com\/","city":"New York","street":"111 Reade Street","fulldate":"20150629T080000Z\/20150629T080000Z 00Zm00Z"}},{"event":{"title":"Whisky Smackdown: Scotch vs. Bourbon @ Astor Center","time":"6:30pm","day":"Monday","month":"Jun","dayofmonth":"29","cost":"$89","free":"This event is not free","location":"Astor Center, NYC","rsvp":"http:\/\/www.astorcenternyc.com\/class-whisky-smackdown-scotch-vs-bourbon.ac","details":"Whisky Smackdown: Scotch vs. Bourbon with Robin Robinson\nDonkeys vs. elephants, Android vs. Apple, King Kong vs. Godzilla - everywhere you go, there’s challenge and competition. Now, we’re going to pit our favorite whiskies against each other to see which ones come out on top. If you’ve graduated from Whisky 101, consider this your certification training. \nIn this section of the popular \"Smackdown Series\" we'll focus on Scotch vs. Bourbon. These two contenders are so different they can’t even agree on spelling - whiskey or whisky? Is one just about youth and energy and the other rife with age and wisdom? Or are they two distant cousins torn apart by the ravages of time and distance? We’ll get to the bottom of the barrel with comparative tastings, cocktail pairings, a lighthearted quiz, and more. \nStraight whiskies and cocktails will be presented.","website":"http:\/\/www.astorcenternyc.com","city":"New York","street":"399 Lafayette St.","fulldate":"20150629T183000Z\/20150629T183000Z 00Zm00Z"}},{"event":{"title":"American Whiskey 101 @ Astor Center","time":"6:30pm","day":"Thursday","month":"Jul","dayofmonth":"9","cost":"$79","free":"This event is not free","location":"Astor Center, NYC","rsvp":"http:\/\/www.astorcenternyc.com\/class-american-whiskey-101.ac","details":"American Whiskey 101 with Allan Roth\nJoin us for an introduction to American Whiskey. In this in-depth tasting class we’ll cover the basics and give you the tools you need to decipher the ever-growing selection of America’s favorite brown spirit. \nWe’ll sample a flight of an assortment of whiskies from all corners of the country, and learn how to taste like a pro. From here we’ll discuss the different styles of whiskey: from sweet and smooth Bourbon, spicy Rye, to illusive Corn Whiskey and the ever mellow Tennessee Whiskey. Along the way, we’ll explore a slightly tipsy version of history, learn how each style is made, and taste how they differ from one another in flavor. When we’re through, you’ll be armed with some guiding principles at your disposal and well equipped to navigate ordering straight spirits (and cocktails), as well as grow your home collection based on your personal preferences. \nWe’ll leave you to answer the question “What makes whiskey so delicious?” on your own.\nLearning objectives:\n-Learn the basic tasting method for whiskey\n-Explore through tasting, the flavor profiles of each spirit\n-Distinguish between the major categories of American Whiskey: Bourbon, Rye, Corn Whiskey and Tennessee Whiskey\n-Understand the production differences for each category\n-Describe the Lincoln County process\nGuests will receive:\n-One welcome beverage\n-Six tasting pours of American whiskies\n-Palate cleansing bread and cheese\n-Two hours of education, including time for Q&amp;A with an Astor Center instructor\n-Access to our state-of-the-art tasting facility","website":"http:\/\/www.astorcenternyc.com","city":"New York","street":"399 Lafayette St.","fulldate":"20150709T183000Z\/20150709T183000Z 00Zm00Z"}}]}