{"events":[{"event":{"title":"Taste Barrell Bourbon and Whiskey @ Gramercy Wine &amp; Spirits","time":"5:00pm","day":"Thursday","month":"Jun","dayofmonth":"11","free":"This event is free","image":"http:\/\/nycwhisky.com\/sites\/nycwhisky.com\/files\/events\/Barrell-Bourbon.jpg","location":"Gramercy Wine &amp; Spirits","details":"5 to 8 PM\nCome taste Barrell Whiskey Batch 001 and Barrell Bourbon Batch 004 and meet the owners at Gramercy Wine &amp; Spirits between 5 PM and 8 PM on Thursday, June 11th.\nBarrell Bourbon won a Double Gold Medal in the 2015 San Francisco World Spirits Competition and was a Finalist in the 2014 and 2015 Ultimate Spirits Challenge, scoring 95\/100. It has been reviewed as \"one smooth sipper\" with a \"long and warming\" finish and a \"complex bouquet of crushed toasted walnuts, honey vanilla and tangerine [that] leaps from the glass.\" Geoff Kleinman, founder and managing editor at DrinkSpirits.com, says \"the folks at Barrell Bourbon have a real knack for picking good whiskeys with great flavor and character.\"\nBarrell Whiskey won a Double Gold Medal in the 2015 San Francisco World Spirits Competition and was a Finalist in the 2015 Ultimate Spirits Challenge, scoring 93\/100. \"Crusty, egg battered brioche – French toast dripping in butter and dark maple syrup. Brooding alcohol explodes right up front, no mistaking the 122.5 Proof stuffing of each slurp. Thin rivulets of bruleed corn pudding. Rich swirls of darkly scented, spicy Mexican chocolate become soft eruptions at the finish, leaving you with visions of the next sip.\"\nBarrell Bourbon and Barrell Whiskey are bottled at cask strength and each batch has a distinct flavor profile. Read more about Barrell Whiskey and Barrell Bourbon at www.barrellbourbon.com Available now in limited quantities at select retailers.\nBarrell Bourbon\nFollow us on Facebook\nFollow us on Twitter\nFollow us on Instagram\nFollow us on LinkedIn","phone":"212-505-0550","socialnetworks":"https:\/\/twitter.com\/GramercyWS","website":"https:\/\/www.gramercywine.com","city":"New York","street":"104 East 23rd Street","fulldate":"20150611T170000Z 00Z"}}]}